cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.c
/*******************************************************************************
* File Name: TIME_COUNTER.c
* Version 2.80
*
* Description:
*  The Timer component consists of a 8, 16, 24 or 32-bit timer with
*  a selectable period between 2 and 2^Width - 1.  The timer may free run
*  or be used as a capture timer as well.  The capture can be initiated
*  by a positive or negative edge signal as well as via software.
*  A trigger input can be programmed to enable the timer on rising edge
*  falling edge, either edge or continous run.
*  Interrupts may be generated due to a terminal count condition
*  or a capture event.
*
* Note:
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#include "TIME_COUNTER.h"

uint8 TIME_COUNTER_initVar = 0u;


/*******************************************************************************
* Function Name: TIME_COUNTER_Init
********************************************************************************
*
* Summary:
*  Initialize to the schematic state
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_Init(void) 
{
    #if(!TIME_COUNTER_UsingFixedFunction)
            /* Interrupt State Backup for Critical Region*/
            uint8 TIME_COUNTER_interruptState;
    #endif /* Interrupt state back up for Fixed Function only */

    #if (TIME_COUNTER_UsingFixedFunction)
        /* Clear all bits but the enable bit (if it's already set) for Timer operation */
        TIME_COUNTER_CONTROL &= TIME_COUNTER_CTRL_ENABLE;

        /* Clear the mode bits for continuous run mode */
        #if (CY_PSOC5A)
            TIME_COUNTER_CONTROL2 &= ((uint8)(~TIME_COUNTER_CTRL_MODE_MASK));
        #endif /* Clear bits in CONTROL2 only in PSOC5A */

        #if (CY_PSOC3 || CY_PSOC5LP)
            TIME_COUNTER_CONTROL3 &= ((uint8)(~TIME_COUNTER_CTRL_MODE_MASK));
        #endif /* CONTROL3 register exists only in PSoC3 OR PSoC5LP */

        /* Check if One Shot mode is enabled i.e. RunMode !=0*/
        #if (TIME_COUNTER_RunModeUsed != 0x0u)
            /* Set 3rd bit of Control register to enable one shot mode */
            TIME_COUNTER_CONTROL |= 0x04u;
        #endif /* One Shot enabled only when RunModeUsed is not Continuous*/

        #if (TIME_COUNTER_RunModeUsed == 2)
            #if (CY_PSOC5A)
                /* Set last 2 bits of control2 register if one shot(halt on
                interrupt) is enabled*/
                TIME_COUNTER_CONTROL2 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Set last 2 bits of control3 register if one shot(halt on
                interrupt) is enabled*/
                TIME_COUNTER_CONTROL3 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL3 for PSoC3 or PSoC5LP */

        #endif /* Remove section if One Shot Halt on Interrupt is not enabled */

        #if (TIME_COUNTER_UsingHWEnable != 0)
            #if (CY_PSOC5A)
                /* Set the default Run Mode of the Timer to Continuous */
                TIME_COUNTER_CONTROL2 |= TIME_COUNTER_CTRL_MODE_PULSEWIDTH;
            #endif /* Set Continuous Run Mode in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Clear and Set ROD and COD bits of CFG2 register */
                TIME_COUNTER_CONTROL3 &= ((uint8)(~TIME_COUNTER_CTRL_RCOD_MASK));
                TIME_COUNTER_CONTROL3 |= TIME_COUNTER_CTRL_RCOD;

                /* Clear and Enable the HW enable bit in CFG2 register */
                TIME_COUNTER_CONTROL3 &= ((uint8)(~TIME_COUNTER_CTRL_ENBL_MASK));
                TIME_COUNTER_CONTROL3 |= TIME_COUNTER_CTRL_ENBL;

                /* Set the default Run Mode of the Timer to Continuous */
                TIME_COUNTER_CONTROL3 |= TIME_COUNTER_CTRL_MODE_CONTINUOUS;
            #endif /* Set Continuous Run Mode in CONTROL3 for PSoC3ES3 or PSoC5A */

        #endif /* Configure Run Mode with hardware enable */

        /* Clear and Set SYNCTC and SYNCCMP bits of RT1 register */
        TIME_COUNTER_RT1 &= ((uint8)(~TIME_COUNTER_RT1_MASK));
        TIME_COUNTER_RT1 |= TIME_COUNTER_SYNC;

        /*Enable DSI Sync all all inputs of the Timer*/
        TIME_COUNTER_RT1 &= ((uint8)(~TIME_COUNTER_SYNCDSI_MASK));
        TIME_COUNTER_RT1 |= TIME_COUNTER_SYNCDSI_EN;

        /* Set the IRQ to use the status register interrupts */
        TIME_COUNTER_CONTROL2 |= TIME_COUNTER_CTRL2_IRQ_SEL;
    #endif /* Configuring registers of fixed function implementation */

    /* Set Initial values from Configuration */
    TIME_COUNTER_WritePeriod(TIME_COUNTER_INIT_PERIOD);
    TIME_COUNTER_WriteCounter(TIME_COUNTER_INIT_PERIOD);

    #if (TIME_COUNTER_UsingHWCaptureCounter)/* Capture counter is enabled */
        TIME_COUNTER_CAPTURE_COUNT_CTRL |= TIME_COUNTER_CNTR_ENABLE;
        TIME_COUNTER_SetCaptureCount(TIME_COUNTER_INIT_CAPTURE_COUNT);
    #endif /* Configure capture counter value */

    #if (!TIME_COUNTER_UsingFixedFunction)
        #if (TIME_COUNTER_SoftwareCaptureMode)
            TIME_COUNTER_SetCaptureMode(TIME_COUNTER_INIT_CAPTURE_MODE);
        #endif /* Set Capture Mode for UDB implementation if capture mode is software controlled */

        #if (TIME_COUNTER_SoftwareTriggerMode)
            #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
                if (0u == (TIME_COUNTER_CONTROL & TIME_COUNTER__B_TIMER__TM_SOFTWARE))
                {
                    TIME_COUNTER_SetTriggerMode(TIME_COUNTER_INIT_TRIGGER_MODE);
                }
            #endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */
        #endif /* Set trigger mode for UDB Implementation if trigger mode is software controlled */

        /* CyEnterCriticalRegion and CyExitCriticalRegion are used to mark following region critical*/
        /* Enter Critical Region*/
        TIME_COUNTER_interruptState = CyEnterCriticalSection();

        /* Use the interrupt output of the status register for IRQ output */
        TIME_COUNTER_STATUS_AUX_CTRL |= TIME_COUNTER_STATUS_ACTL_INT_EN_MASK;

