cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.c
        /* Exit Critical Region*/
        CyExitCriticalSection(TIME_COUNTER_interruptState);

        #if (TIME_COUNTER_EnableTriggerMode)
            TIME_COUNTER_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/
		
		
        #if (TIME_COUNTER_InterruptOnCaptureCount && !TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
            TIME_COUNTER_SetInterruptCount(TIME_COUNTER_INIT_INT_CAPTURE_COUNT);
        #endif /* Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        TIME_COUNTER_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    TIME_COUNTER_SetInterruptMode(TIME_COUNTER_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: TIME_COUNTER_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (TIME_COUNTER_UsingFixedFunction)
        TIME_COUNTER_GLOBAL_ENABLE |= TIME_COUNTER_BLOCK_EN_MASK;
        TIME_COUNTER_GLOBAL_STBY_ENABLE |= TIME_COUNTER_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED || TIME_COUNTER_UsingFixedFunction)
        TIME_COUNTER_CONTROL |= TIME_COUNTER_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  TIME_COUNTER_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void TIME_COUNTER_Start(void) 
{
    if(TIME_COUNTER_initVar == 0u)
    {
        TIME_COUNTER_Init();

        TIME_COUNTER_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    TIME_COUNTER_Enable();
}


/*******************************************************************************
* Function Name: TIME_COUNTER_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void TIME_COUNTER_Stop(void) 
{
    /* Disable Timer */
    #if(!TIME_COUNTER_UDB_CONTROL_REG_REMOVED || TIME_COUNTER_UsingFixedFunction)
        TIME_COUNTER_CONTROL &= ((uint8)(~TIME_COUNTER_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (TIME_COUNTER_UsingFixedFunction)
        TIME_COUNTER_GLOBAL_ENABLE &= ((uint8)(~TIME_COUNTER_BLOCK_EN_MASK));
        TIME_COUNTER_GLOBAL_STBY_ENABLE &= ((uint8)(~TIME_COUNTER_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: TIME_COUNTER_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_SetInterruptMode(uint8 interruptMode) 
{
    TIME_COUNTER_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: TIME_COUNTER_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void TIME_COUNTER_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    #if(TIME_COUNTER_UsingFixedFunction)
        (void)CY_GET_REG16(TIME_COUNTER_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIME_COUNTER_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIME_COUNTER_UsingFixedFunction) */
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   TIME_COUNTER_ReadStatusRegister(void) 
{
    return (TIME_COUNTER_STATUS);
}


#if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) /* Remove API if control register is unused */


