cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.c
/*******************************************************************************
* Function Name: TIME_COUNTER_ReadControlRegister
********************************************************************************
*
* Summary:
*  Reads the control register and returns it's value.
*
* Parameters:
*  void
*
* Return:
*  The contents of the control register
*
*******************************************************************************/
uint8 TIME_COUNTER_ReadControlRegister(void) 
{
    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) 
        return ((uint8)TIME_COUNTER_CONTROL);
    #else
        return (0);
    #endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_WriteControlRegister
********************************************************************************
*
* Summary:
*  Sets the bit-field of the control register.
*
* Parameters:
*  control: The contents of the control register
*
* Return:
*
*******************************************************************************/
void TIME_COUNTER_WriteControlRegister(uint8 control) 
{
    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) 
        TIME_COUNTER_CONTROL = control;
    #else
        control = 0u;
    #endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */
}

#endif /* Remove API if control register is unused */


/*******************************************************************************
* Function Name: TIME_COUNTER_ReadPeriod
********************************************************************************
*
* Summary:
*  This function returns the current value of the Period.
*
* Parameters:
*  void
*
* Return:
*  The present value of the counter.
*
*******************************************************************************/
uint32 TIME_COUNTER_ReadPeriod(void) 
{
   #if(TIME_COUNTER_UsingFixedFunction)
       return ((uint32)CY_GET_REG16(TIME_COUNTER_PERIOD_LSB_PTR));
   #else
       return (CY_GET_REG32(TIME_COUNTER_PERIOD_LSB_PTR));
   #endif /* (TIME_COUNTER_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_WritePeriod
********************************************************************************
*
* Summary:
*  This function is used to change the period of the counter.  The new period
*  will be loaded the next time terminal count is detected.
*
* Parameters:
*  period: This value may be between 1 and (2^Resolution)-1.  A value of 0 will
*          result in the counter remaining at zero.
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_WritePeriod(uint32 period) 
{
    #if(TIME_COUNTER_UsingFixedFunction)
        uint16 period_temp = (uint16)period;
        CY_SET_REG16(TIME_COUNTER_PERIOD_LSB_PTR, period_temp);
    #else
        CY_SET_REG32(TIME_COUNTER_PERIOD_LSB_PTR, period);
    #endif /*Write Period value with appropriate resolution suffix depending on UDB or fixed function implementation */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_ReadCapture
********************************************************************************
*
* Summary:
*  This function returns the last value captured.
*
* Parameters:
*  void
*
* Return:
*  Present Capture value.
*
*******************************************************************************/
uint32 TIME_COUNTER_ReadCapture(void) 
{
   #if(TIME_COUNTER_UsingFixedFunction)
       return ((uint32)CY_GET_REG16(TIME_COUNTER_CAPTURE_LSB_PTR));
   #else
       return (CY_GET_REG32(TIME_COUNTER_CAPTURE_LSB_PTR));
   #endif /* (TIME_COUNTER_UsingFixedFunction) */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_WriteCounter
********************************************************************************
*
* Summary:
*  This funtion is used to set the counter to a specific value
*
* Parameters:
*  counter:  New counter value.
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_WriteCounter(uint32 counter) 
{
   #if(TIME_COUNTER_UsingFixedFunction)
        /* This functionality is removed until a FixedFunction HW update to
         * allow this register to be written
         */
        CY_SET_REG16(TIME_COUNTER_COUNTER_LSB_PTR, (uint16)counter);
        
    #else
        CY_SET_REG32(TIME_COUNTER_COUNTER_LSB_PTR, counter);
    #endif /* Set Write Counter only for the UDB implementation (Write Counter not available in fixed function Timer */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_ReadCounter
********************************************************************************
*
* Summary:
*  This function returns the current counter value.
*
* Parameters:
*  void
*
* Return:
*  Present compare value.
*
*******************************************************************************/
uint32 TIME_COUNTER_ReadCounter(void) 
{
    /* Force capture by reading Accumulator */
    /* Must first do a software capture to be able to read the counter */
    /* It is up to the user code to make sure there isn't already captured data in the FIFO */
    #if(TIME_COUNTER_UsingFixedFunction)
        (void)CY_GET_REG16(TIME_COUNTER_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIME_COUNTER_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIME_COUNTER_UsingFixedFunction) */

    /* Read the data from the FIFO (or capture register for Fixed Function)*/
    #if(TIME_COUNTER_UsingFixedFunction)
        return ((uint32)CY_GET_REG16(TIME_COUNTER_CAPTURE_LSB_PTR));
    #else
        return (CY_GET_REG32(TIME_COUNTER_CAPTURE_LSB_PTR));
    #endif /* (TIME_COUNTER_UsingFixedFunction) */
}


#if(!TIME_COUNTER_UsingFixedFunction) /* UDB Specific Functions */

    
/*******************************************************************************
 * The functions below this point are only available using the UDB
 * implementation.  If a feature is selected, then the API is enabled.
 ******************************************************************************/


#if (TIME_COUNTER_SoftwareCaptureMode)


