cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.c
/*******************************************************************************
* Function Name: TIME_COUNTER_SetCaptureMode
********************************************************************************
*
* Summary:
*  This function sets the capture mode to either rising or falling edge.
*
* Parameters:
*  captureMode: This parameter sets the capture mode of the UDB capture feature
*  The parameter values are defined using the
*  #define TIME_COUNTER__B_TIMER__CM_NONE 0
#define TIME_COUNTER__B_TIMER__CM_RISINGEDGE 1
#define TIME_COUNTER__B_TIMER__CM_FALLINGEDGE 2
#define TIME_COUNTER__B_TIMER__CM_EITHEREDGE 3
#define TIME_COUNTER__B_TIMER__CM_SOFTWARE 4
 identifiers
*  The following are the possible values of the parameter
*  TIME_COUNTER__B_TIMER__CM_NONE        - Set Capture mode to None
*  TIME_COUNTER__B_TIMER__CM_RISINGEDGE  - Rising edge of Capture input
*  TIME_COUNTER__B_TIMER__CM_FALLINGEDGE - Falling edge of Capture input
*  TIME_COUNTER__B_TIMER__CM_EITHEREDGE  - Either edge of Capture input
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_SetCaptureMode(uint8 captureMode) 
{
    /* This must only set to two bits of the control register associated */
    captureMode = ((uint8)((uint8)captureMode << TIME_COUNTER_CTRL_CAP_MODE_SHIFT));
    captureMode &= (TIME_COUNTER_CTRL_CAP_MODE_MASK);

    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIME_COUNTER_CONTROL &= ((uint8)(~TIME_COUNTER_CTRL_CAP_MODE_MASK));

        /* Write The New Setting */
        TIME_COUNTER_CONTROL |= captureMode;
    #endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */
}
#endif /* Remove API if Capture Mode is not Software Controlled */


#if (TIME_COUNTER_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: TIME_COUNTER_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define TIME_COUNTER__B_TIMER__TM_NONE 0x00u
    #define TIME_COUNTER__B_TIMER__TM_RISINGEDGE 0x04u
    #define TIME_COUNTER__B_TIMER__TM_FALLINGEDGE 0x08u
    #define TIME_COUNTER__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define TIME_COUNTER__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= TIME_COUNTER_CTRL_TRIG_MODE_MASK;

    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
    
        /* Clear the Current Setting */
        TIME_COUNTER_CONTROL &= ((uint8)(~TIME_COUNTER_CTRL_TRIG_MODE_MASK));

        /* Write The New Setting */
        TIME_COUNTER_CONTROL |= (triggerMode | TIME_COUNTER__B_TIMER__TM_SOFTWARE);
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (TIME_COUNTER_EnableTriggerMode)


/*******************************************************************************
* Function Name: TIME_COUNTER_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_EnableTrigger(void) 
{
    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
        TIME_COUNTER_CONTROL |= TIME_COUNTER_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: TIME_COUNTER_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_DisableTrigger(void) 
{
    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED )   /* Remove assignment if control register is removed */
        TIME_COUNTER_CONTROL &= ((uint8)(~TIME_COUNTER_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */

#if(TIME_COUNTER_InterruptOnCaptureCount)


/*******************************************************************************
* Function Name: TIME_COUNTER_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= TIME_COUNTER_CTRL_INTCNT_MASK;

    #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIME_COUNTER_CONTROL &= ((uint8)(~TIME_COUNTER_CTRL_INTCNT_MASK));
        /* Write The New Setting */
        TIME_COUNTER_CONTROL |= interruptCount;
    #endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */
}
#endif /* TIME_COUNTER_InterruptOnCaptureCount */


#if (TIME_COUNTER_UsingHWCaptureCounter)


