cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.c
/*******************************************************************************
* Function Name: TIME_COUNTER_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_SetCaptureCount(uint8 captureCount) 
{
    TIME_COUNTER_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIME_COUNTER_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIME_COUNTER_ReadCaptureCount(void) 
{
    return ((uint8)TIME_COUNTER_CAP_COUNT);
}
#endif /* TIME_COUNTER_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIME_COUNTER_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIME_COUNTER_ClearFIFO(void) 
{
    while(0u != (TIME_COUNTER_ReadStatusRegister() & TIME_COUNTER_STATUS_FIFONEMP))
    {
        (void)TIME_COUNTER_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
